KPDDev/dsPIC_inverter/mcc_generated_files/pwm.h
/**
  PWM Generated Driver API Header File

  @Company
    Microchip Technology Inc.

  @File Name
    pwm.h

  @Summary
    This is the generated header file for the PWM driver using PIC24 / dsPIC33 / PIC32MM MCUs

  @Description
    This header file provides APIs for driver for PWM.
    Generation Information :
        Product Revision  :  PIC24 / dsPIC33 / PIC32MM MCUs - 1.169.0
        Device            :  dsPIC33EP32MC204
    The generated drivers are tested against the following:
        Compiler          :  XC16 v1.50
        MPLAB 	          :  MPLAB X v5.40
*/

/*
    (c) 2020 Microchip Technology Inc. and its subsidiaries. You may use this
    software and any derivatives exclusively with Microchip products.

    THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER
    EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED
    WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A
    PARTICULAR PURPOSE, OR ITS INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION
    WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION.

    IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE,
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND
    WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS
    BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE
    FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN
    ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
    THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.

    MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE
    TERMS.
*/

#ifndef _PWM_H
#define _PWM_H

/**
  Section: Included Files
*/

#include <xc.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>

#ifdef __cplusplus  // Provide C++ Compatibility

    extern "C" {

#endif

/**
  Section: Data Types
*/
/** PWM Driver Specific Macro Definition
 
 @Summary 
   Defines the PWM driver specific macro definitions.
 
 @Description
   This routine defines the PWM driver specific macro definitions.
 
 Remarks:
   None
 */
#define PWM_OVERRIDE_DATA_MASK                  0x00c0
#define PWM_OVERRIDE_DATA_POSITION              6
#define PWM_OVERRIDE_DATA_HIGH_MASK             0x0080
#define PWM_OVERRIDE_DATA_HIGH_POSITION         7
#define PWM_OVERRIDE_DATA_LOW_MASK              0x0040
#define PWM_OVERRIDE_DATA_LOW_POSITION          6
#define PWM_OVERRIDE_HIGH_MASK                  0x0200
#define PWM_OVERRIDE_LOW_MASK                   0x0100
#define PWM_FAULT_LATCH_MASK                    0x0003
#define PWM_FAULT_LATCH_POSITION                0
#define PWM_FAULT_LATCH_ENABLE_VALUE            0x0000
#define PWM_FAULT_LATCH_DISABLE_VALUE           0x0011

/** PWM Generator Definition
 
 @Summary 
   Defines the PWM generators available for PWM
 
 @Description
   This routine defines the PWM generators that are available for the module to use.
 
 Remarks:
   None
 */
typedef enum 
{
    PWM_UNFLD =  1,       
    PWM_A =  2,       
    PWM_B =  3,       
} PWM_GENERATOR;

/** PWM Generator Interrupt Definition
 
 @Summary 
   Defines the PWM generator interrupt available for PWM
 
 @Description
   This routine defines the PWM generator interrupt that are available for the module to use.
 
 Remarks:
   None
 */
typedef enum 
{
    PWM_GENERATOR_INTERRUPT_FAULT =  1,       
    PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT =  2,
    PWM_GENERATOR_INTERRUPT_TRIGGER =  3,	
} PWM_GENERATOR_INTERRUPT;

/**
  Section: Interface Routines
*/

/**
  @Summary
    Initializes PWM module.

  @Description
    This routine initializes PWM module, using the given initialization data. 

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
    bool status;
    uint16_t masterPeriod,masterDutyCycle;
    uint16_t compareValue;

    compareValue = 0x1;

    masterPeriod = 0xFFFF;
    masterDutyCycle = 0xFF;


    PWM_Initialize();

    PWM_Disable();

    PWM_MasterDutyCycleSet(masterDutyCycle);
    PWM_MasterPeriodSet(period);

    PWM_SpecialEventPrimaryInterruptDisable();
    PWM_SpecialEventTriggerInterruptFlagClear();
    PWM_SpecialEventPrimaryCompareValueSet(compareValue);
    PWM_SpecialEventPrimaryInterruptEnable();

    PWM_Enable();
    </code>
*/
void PWM_Initialize (void);

/**
  @Summary
    Enables the PWM module.

  @Description
    This routine is used to enable the PWM module.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
    PWM_Enable();
    </code>
*/
inline static void PWM_Enable(void)
{
	PTCONbits.PTEN = true; 
}

/**
  @Summary
    Disables the PWM module.

  @Description
    This routine is used to disable the PWM module.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
    PWM_Disable();
    </code>
*/
inline static void PWM_Disable(void)
{
	PTCONbits.PTEN = false; 
}

/**
  @Summary
    Sets the period value in count for the Primary Master Time Base generator.

  @Description
    This routine is used to set the period value in count for the Primary Master Time Base generator.

  @Param
    masterPeriod - Period value in count.

  @Returns
    None
 
  @Example 
    <code>
    uint16_t masterPeriod;

    masterPeriod = 0xFF;
    
    PWM_MasterPeriodSet(masterPeriod);
    </code>
*/
inline static void PWM_MasterPeriodSet(uint16_t masterPeriod)
{
    PTPER = masterPeriod;
}

/**
  @Summary
    Used to set the PWM master duty cycle register.

  @Description
    This routine is used to set the PWM master duty cycle register.

  @Param
    masterDutyCycle - Master Duty Cyle value.

  @Returns
    None
 
  @Example 
    <code>
    uint16_t masterDutyCycle;

    masterDutyCycle = 0xFF;
    
