KPDDev/dsPIC_inverter/mcc_generated_files/pwm.h
    switch(genNum) { 
        case PWM_UNFLD:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							status = PWMCON1bits.FLTSTAT;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							status = PWMCON1bits.CLSTAT;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							status = PWMCON1bits.TRGSTAT;
							break;							
					default:break;  
				}              
                break; 
        case PWM_A:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							status = PWMCON2bits.FLTSTAT;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							status = PWMCON2bits.CLSTAT;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							status = PWMCON2bits.TRGSTAT;
							break;							
					default:break;  
				}              
                break; 
        case PWM_B:
				switch(interrupt) { 
					case PWM_GENERATOR_INTERRUPT_FAULT:
							status = PWMCON3bits.FLTSTAT;               
							break;       
					case PWM_GENERATOR_INTERRUPT_CURRENT_LIMIT:
							status = PWMCON3bits.CLSTAT;
							break;
					case PWM_GENERATOR_INTERRUPT_TRIGGER:
							status = PWMCON3bits.TRGSTAT;
							break;							
					default:break;  
				}              
                break; 
        default:break;  
    }
	return status;
}

/**
  @Summary
    Sets the compare value in count for the Special Event Trigger from the Primary time base generator.

  @Description
    This routine is used to set the compare value in count for the Special Event Trigger from the Primary time base generator.

  @Param
    compareValue - Compare value in count.

  @Returns
    None
 
  @Example 
    <code>
    uint16_t compareValue;

    compareValue = 0xFF;
    
    PWM_SpecialEventPrimaryCompareValueSet(compareValue);
    </code>
*/  
inline static void PWM_SpecialEventPrimaryCompareValueSet(uint16_t compareValue)
{
    SEVTCMP = compareValue;
}

/**
  @Summary
    Clears PWM Special Event Trigger interrupt request flag.

  @Description
    This routine is used to clear PWM Special Event Trigger interrupt request flag.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
    PWM_SpecialEventTriggerInterruptFlagClear();
    </code>
*/ 
inline static void PWM_SpecialEventTriggerInterruptFlagClear(void)
{
    IFS3bits.PSEMIF = false;
}

/**
  @Summary
    Enables interrupt request for Special Event Trigger from the Primary time base generator.

  @Description
    This routine is used to enable interrupt request for Special Event Trigger from the Primary time base generator.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
    PWM_SpecialEventPrimaryInterruptEnable();
    </code>
*/  
inline static void PWM_SpecialEventPrimaryInterruptEnable(void)
{
	PTCONbits.SEIEN = true; 
}

/**
  @Summary
    Disables interrupt request for Special Event Trigger from the Primary time base generator.

  @Description
    This routine is used to disable interrupt request for Special Event Trigger from the Primary time base generator.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
    PWM_SpecialEventPrimaryInterruptDisable();
    </code>
*/  
inline static void PWM_SpecialEventPrimaryInterruptDisable(void)
{
	PTCONbits.SEIEN = false; 
}

/**
  @Summary
    Enables PWM latched fault mode for the PWM Generator.

  @Description
    This routine is used to enable PWM latched fault mode for the PWM 
    Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_FaultModeLatchEnable(genNum);
    </code>
*/ 
inline static void PWM_FaultModeLatchEnable(PWM_GENERATOR genNum)
{
    uint16_t faultValue;
    
    switch(genNum) { 
        case PWM_UNFLD:
                faultValue = ((FCLCON1 & (~(PWM_FAULT_LATCH_MASK))) | PWM_FAULT_LATCH_ENABLE_VALUE);
                __builtin_write_PWMSFR(&FCLCON1, faultValue, &PWMKEY);
                break;       
        case PWM_A:
                faultValue = ((FCLCON2 & (~(PWM_FAULT_LATCH_MASK))) | PWM_FAULT_LATCH_ENABLE_VALUE);
                __builtin_write_PWMSFR(&FCLCON2, faultValue, &PWMKEY);
                break;       
        case PWM_B:
                faultValue = ((FCLCON3 & (~(PWM_FAULT_LATCH_MASK))) | PWM_FAULT_LATCH_ENABLE_VALUE);
                __builtin_write_PWMSFR(&FCLCON3, faultValue, &PWMKEY);
                break;       
        default:break;    
    }
}

/**
  @Summary
    Disables PWM latched fault mode for the PWM Generator selected by the 
    argument PWM_GENERATOR.

  @Description
    This routine is used to disable PWM latched fault mode for the PWM 
    Generator selected by the argument PWM_GENERATOR.

  @Param
    genNum - PWM generator number.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_GENERATOR genNum;
    
    genNum = PWM_GENERATOR_1;
    PWM_FaultModeLatchDisable(genNum);
    </code>
*/  
inline static void PWM_FaultModeLatchDisable(PWM_GENERATOR genNum)
{
    uint16_t faultValue;
    
    switch(genNum) { 
        case PWM_UNFLD: 
                faultValue = ((FCLCON1 & (~(PWM_FAULT_LATCH_MASK))) | PWM_FAULT_LATCH_DISABLE_VALUE);
                __builtin_write_PWMSFR(&FCLCON1, faultValue, &PWMKEY);
                break;       
        case PWM_A: 
                faultValue = ((FCLCON2 & (~(PWM_FAULT_LATCH_MASK))) | PWM_FAULT_LATCH_DISABLE_VALUE);
                __builtin_write_PWMSFR(&FCLCON2, faultValue, &PWMKEY);
                break;       
        case PWM_B: 
                faultValue = ((FCLCON3 & (~(PWM_FAULT_LATCH_MASK))) | PWM_FAULT_LATCH_DISABLE_VALUE);
                __builtin_write_PWMSFR(&FCLCON3, faultValue, &PWMKEY);
                break;       
        default:break;   
    }   
}

/**
  @Summary
    Callback for PWM Special Event.

  @Description
    This routine is callback for PWM Special Event

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_SpecialEvent_CallBack();
    </code>
*/
void PWM_SpecialEvent_CallBack(void);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for polled implementations.
  
  @Preconditions
    PWM_Initialize() function should have been 
    called before calling this function.
 
  @Returns 
    None
 
  @Param
    None
 
  @Example
    <code>    
    PWM_SpecialEvent_Tasks();
    </code>
    
*/
void PWM_SpecialEvent_Tasks(void);

/**
  @Summary
    Callback for PWM Generator1.

  @Description
    This routine is callback for PWM Generator1

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_Generator1_CallBack();
    </code>
*/
void PWM_Generator1_CallBack(void);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for polled implementations.
  
  @Preconditions
    PWM_Initialize() function should have been 
    called before calling this function.
 
  @Returns 
    None
 
  @Param
    None
 
  @Example
    <code>    
    PWM_Generator1_Tasks();
    </code>   
*/
void PWM_Generator1_Tasks(void);

/**
  @Summary
    Callback for PWM Generator2.

  @Description
    This routine is callback for PWM Generator2

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_Generator2_CallBack();
    </code>
*/
void PWM_Generator2_CallBack(void);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for polled implementations.
  
  @Preconditions
    PWM_Initialize() function should have been 
    called before calling this function.
 
  @Returns 
    None
 
  @Param
    None
 
  @Example
    <code>    
    PWM_Generator2_Tasks();
    </code>   
*/
void PWM_Generator2_Tasks(void);

/**
  @Summary
    Callback for PWM Generator3.

  @Description
    This routine is callback for PWM Generator3

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>    
    PWM_Generator3_CallBack();
    </code>
*/
void PWM_Generator3_CallBack(void);

/**
  @Summary
    Assigns a function pointer with a PWM Generator3 callback address.

  @Description
    This routine assigns a function pointer with a PWM Generator3 
    callback address.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
    PWM_SetGenerator3InterruptHandler(&PWM_Generator3_CallBack);
    </code>
*/
void PWM_SetGenerator3InterruptHandler(void *handler);


